In [2]:
import pandas as pd
import numpy as np

In [6]:
df=pd.DataFrame({'A': [1,2,np.nan],
                  'B': [5,np.nan,np.nan],
                  'C': [1,2,3]})

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [16]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [17]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [19]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [20]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [21]:
df.fillna(value=4)

     A    B  C
0  1.0  5.0  1
1  2.0  4.0  2
2  4.0  4.0  3

In [22]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64